nxp-mcuxpresso/mcux-soc-svd/MCXC352/MCXC352.xml
        <register>
          <name>RD_PATH_CTRL_STATUS</name>
          <description>Read Path Control and Status Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_CAPT</name>
              <description>Read Capture Clock Periods</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_SIZE</name>
              <description>SE Clock Periods</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_ENABLEB</name>
              <description>ECC Decoder Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz189</name>
                  <description>ECC decoder enabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz190</name>
                  <description>ECC decoder disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MISR_EN</name>
              <description>MISR Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz187</name>
                  <description>MISR option disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz188</name>
                  <description>MISR option enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPY_PAR_EN</name>
              <description>Copy Parity Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz185</name>
                  <description>Copy parity disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz186</name>
                  <description>Copy parity enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_MUX_TO_SMW</name>
              <description>BIST Mux to SMW</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz183</name>
                  <description>BIST drives fields</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz184</name>
                  <description>SMW registers drive fields</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AD_SET</name>
              <description>Multi-Cycle Address Setup Time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_PATH_EN</name>
              <description>Write Path Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz181</name>
                  <description>Writes to BIST setting registers driven by MM_WDATA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz182</name>
                  <description>Writes to BIST setting registers driven by SMW_DIN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PATH_ECC_EN</name>
              <description>Write Path ECC Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz179</name>
                  <description>ECC encoding disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz180</name>
                  <description>ECC encoding enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBERR_REG</name>
              <description>Double-Bit Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz177</name>
                  <description>Double-bit fault not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz178</name>
                  <description>Double-bit fault detected on previous UINT flash read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBERR_REG</name>
              <description>Single-Bit Error</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz175</name>
                  <description>Single-bit fault not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz176</name>
                  <description>Single-bit fault detected on previous UINT flash read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPY_PHRASE_EN</name>
              <description>Copy Phrase Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz173</name>
                  <description>Copy Flash read data disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz174</name>
                  <description>Copy Flash read data enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMW_ARRAY1_SMW0_SEL</name>
              <description>SMW_ARRAY1_SMW0_SEL</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz171</name>
                  <description>Select block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz172</name>
                  <description>Select block 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_ECC_EN</name>
              <description>BIST ECC Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz169</name>
                  <description>ECC correction disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz170</name>
                  <description>ECC correction enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_READ</name>
              <description>Last Read</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz167</name>
                  <description>Latest read not last in multi-address operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz168</name>
                  <description>Latest read last in multi-address operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_DIN0</name>
          <description>SMW DIN 0 Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_DIN0</name>
              <description>SMW DIN 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_DIN1</name>
          <description>SMW DIN 1 Register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_DIN1</name>
              <description>SMW DIN 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_DIN2</name>
          <description>SMW DIN 2 Register</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_DIN2</name>
              <description>SMW DIN 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_DIN3</name>
          <description>SMW DIN 3 Register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_DIN3</name>
              <description>SMW DIN 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_ADDR</name>
          <description>SMW Address Register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_ADDR</name>
              <description>SMW Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_CMD_WAIT</name>
          <description>SMW Command and Wait Register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>SMW Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz193</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz194</name>
                  <description>ABORT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz195</name>
                  <description>SME2 to one-shot mass erase</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz196</name>
                  <description>SME3 to sector erase on selected array</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz197</name>
                  <description>SMP1 to program phrase or page on selected array with shot disabled on previously programmed bit</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz199</name>
                  <description>SMP2 to program phrase or page on selected array to repair cells of weak program after power loss</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_EN</name>
              <description>SMW Wait Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz191</name>
                  <description>Wait feature disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz192</name>
                  <description>Wait feature enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_AUTO_SET</name>
              <description>SMW Wait Auto Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_STATUS</name>
          <description>SMW Status Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_ERR</name>
              <description>SMW Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz205</name>
                  <description>Error not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz206</name>
                  <description>Error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMW_BUSY</name>
              <description>SMW Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz203</name>
                  <description>SMW command not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz204</name>
                  <description>SMW command is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_BUSY</name>
              <description>BIST Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz201</name>
                  <description>BIST Command not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz202</name>
                  <description>BIST Command is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM0_0</name>
          <description>SoC Trim Phrase 0 Word 0 Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM0_0</name>
              <description>TRIM0_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM0_1</name>
          <description>SoC Trim Phrase 0 Word 1 Register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM0_1</name>
              <description>TRIM0_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM0_2</name>
          <description>SoC Trim Phrase 0 Word 2 Register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM0_2</name>
              <description>TRIM0_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM0_3</name>
          <description>SoC Trim Phrase 0 Word 3 Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM0_3</name>
              <description>TRIM0_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM1_0</name>
          <description>SoC Trim Phrase 1 Word 0 Register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM1_0</name>
              <description>TRIM1_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM1_1</name>
          <description>SoC Trim Phrase 1 Word 1 Register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM1_1</name>
              <description>TRIM1_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM1_2</name>
          <description>SoC Trim Phrase 1 Word 2 Register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM1_2</name>
              <description>TRIM1_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOCTRIM1_3</name>
          <description>SoC Trim Phrase 1 Word 3 Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM1_3</name>
              <description>TRIM1_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
