nxp-mcuxpresso/mcux-soc-svd/MCXC352/MCXC352.xml
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20</dimIndex>
          <name>CMD%s</name>
          <description>Command Buffer Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPEN</name>
              <description>Compare Function Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED_ALWAYS_STORE_RESULT</name>
                  <description>Compare disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_ALWAYS_STORE_RESULT</name>
                  <description>Compare enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_TRIG</name>
              <description>Wait for Trigger Assertion before Execution.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>This command will be automatically executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The active trigger must be asserted again before executing this command.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Conversion Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OnlyA</name>
                  <description>Single-Ended Mode. Only A side channel is converted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OnlyB</name>
                  <description>Single-Ended Mode. Only B side channel is converted.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Diff</name>
                  <description>Differential Mode. A-B.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DualSE</name>
                  <description>Dual-Single-Ended Mode. Both A side and B side channels are converted independently.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Select Resolution of Conversions</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Standard resolution. Single-ended 12-bit conversion or differential 13-bit conversion with 2's complement output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>High resolution. Single-ended 16-bit conversion or differential 16-bit conversion with 2's complement output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDIS</name>
              <description>Command Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Enable current command buffer register, the conversion sequence will continue.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Disable current command buffer. the conversion sequence is ended when previous command buffer is executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Sample Time Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLE_3p5</name>
                  <description>Minimum sample time of 3.5 ADCK cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_5p5</name>
                  <description>3.5 + 2 1 ADCK cycles; 5.5 ADCK cycles total sample time.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_7p5</name>
                  <description>3.5 + 2 2 ADCK cycles; 7.5 ADCK cycles total sample time.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_11p5</name>
                  <description>3.5 + 2 3 ADCK cycles; 11.5 ADCK cycles total sample time.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_19p5</name>
                  <description>3.5 + 2 4 ADCK cycles; 19.5 ADCK cycles total sample time.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_35p5</name>
                  <description>3.5 + 2 5 ADCK cycles; 35.5 ADCK cycles total sample time.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_67p5</name>
                  <description>3.5 + 2 6 ADCK cycles; 67.5 ADCK cycles total sample time.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_131p5</name>
                  <description>3.5 + 2 7 ADCK cycles; 131.5 ADCK cycles total sample time.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>Single conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_2</name>
                  <description>2 conversions averaged.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_4</name>
                  <description>4 conversions averaged.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_8</name>
                  <description>8 conversions averaged.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_16</name>
                  <description>16 conversions averaged.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_32</name>
                  <description>32 conversions averaged.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_64</name>
                  <description>64 conversions averaged.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_128</name>
                  <description>128 conversions averaged.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_256</name>
                  <description>256 conversions averaged.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_512</name>
                  <description>512 conversions averaged.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024_10</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024_11</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024_12</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024_13</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024_14</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVERAGE_1024_15</name>
                  <description>1024 conversions averaged.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCH</name>
              <description>Input Channel Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0X</name>
                  <description>Select CH0A or CH0B or CH0A/CH0B pair.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1X</name>
                  <description>Select CH1A or CH1B or CH1A/CH1B pair.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2X</name>
                  <description>Select CH2A or CH2B or CH2A/CH2B pair.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3X</name>
                  <description>Select CH3A or CH3B or CH3A/CH3B pair.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_4</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_5</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_6</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_7</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_8</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_9</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_10</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_11</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_12</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_13</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_24</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_25</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_26</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_27</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_28</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_EXECUTES_CORRESPONDING_X_29</name>
                  <description>Select corresponding channel CHnA or CHnB or CHnA/CHnB pair.</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1EX</name>
                  <description>Select CH30A or CH30B or CH30A/CH30B pair.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1FX</name>
                  <description>Select CH31A or CH31B or CH31A/CH31B pair.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTB_ADCH</name>
              <description>Alternate Channel B Input channel select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCB0</name>
                  <description>Select CH0B</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB1</name>
                  <description>Select CH1B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB2</name>
                  <description>Select CH2B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB3</name>
                  <description>Select CH3B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_4</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_5</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_6</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_7</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_8</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_9</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_10</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_11</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_12</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_13</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_24</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_25</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_26</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_27</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_28</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB20_29</name>
                  <description>Select corresponding channel CHnB</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB30</name>
                  <description>Select CH30B</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCB31</name>
                  <description>Select CH31B</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALTB_EN</name>
              <description>Alternate Channel B Select Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ALTB_ADCH disabled. Channel A and Channel B inputs are selected based on ADCH settings.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>ALTB_ADCH enabled. Channel A inputs selected by ADCH setting and Channel B inputs selected by ALTB_ADCH setting.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
