nxp-mcuxpresso/mcux-soc-svd/MCXC352/MCXC352.xml
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20</dimIndex>
          <name>CV%s</name>
          <description>Compare Value Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CVL</name>
              <description>Compare Value Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CVH</name>
              <description>Compare Value High</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <description>Status 0 Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_RDY</name>
              <description>Status of Calibration Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_SET</name>
                  <description>Calibration is incomplete or hasn't been ran.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE_CAL_STEP_COMPLETED</name>
                  <description>Calibrated is complete.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_ACTIVEA</name>
              <description>ADC Active for ADCA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ACTIVE</name>
                  <description>The DUALADC is IDLE.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>The DUALADC is processing a conversion, running through the power up delay, or servicing a trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACTA</name>
              <description>Command Active for ADCA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMMAND_ACTIVE</name>
                  <description>No command is currently in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_1</name>
                  <description>Command 1 currently being executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_2</name>
                  <description>Command 2 currently being executed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_3</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_4</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_5</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_6</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_7</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_8</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_9</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_10</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_11</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_12</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_15</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_16</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_17</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_18</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_19</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_20</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGTSTSA</name>
              <description>Status of &quot;Average with Timer&quot; for ADCA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_ACTIVEB</name>
              <description>ADCB Active</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ACTIVE</name>
                  <description>The ADCB is IDLE.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>The ADCB is processing a conversion, running through the power up delay, or servicing a trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACTB</name>
              <description>Command Active for ADCB</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMMAND_ACTIVE</name>
                  <description>No command is currently in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_1</name>
                  <description>Command 11 currently being executed.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_2</name>
                  <description>Command 12 currently being executed.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_13</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_14</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_15</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_16</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_17</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_18</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_19</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMAND_x_20</name>
                  <description>Associated command number is currently being executed.</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGTSTSB</name>
              <description>Status of &quot;Average with Timer&quot; for ADCB</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP_STAT</name>
          <description>Compare Status Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CMPIn</name>
              <description>Compare Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cmp0</name>
                  <description>All compare results are false.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp1</name>
                  <description>Compare result of CMD1 is true.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp2</name>
                  <description>Compare result of CMD2 is true.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_4</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_5</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_6</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_7</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_8</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_9</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_10</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_11</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_12</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_13</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_131067</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x1FFFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_131068</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x1FFFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_131069</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x1FFFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_131070</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x1FFFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_131071</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x1FFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp3_131072</name>
                  <description>Compare result of CMDn is true,where n=3...19.</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cmp20</name>
                  <description>Compare result of CMD20 is true.</description>
                  <value>0x40000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
