nxp-mcuxpresso/mcux-soc-svd/MCXC352/MCXC352.xml
        <register>
          <name>RSLTRDY_STAT</name>
          <description>Result Ready Status Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDYn</name>
              <description>Result Ready Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDY0</name>
                  <description>Corresponding bit indicates the result is not ready or has been read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY1</name>
                  <description>The result of CMD1 is ready to be read from RSLT1 register. Clear this bit by reading the corresponding RSLT1 register.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY2</name>
                  <description>The result of CMD2 is ready to be read from RSLT2 register. Clear this bit by reading the corresponding RSLT2 register.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_4</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_5</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_6</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_7</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_8</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_9</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_10</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_11</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_12</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_13</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_131067</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x1FFFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_131068</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x1FFFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_131069</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x1FFFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_131070</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x1FFFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_131071</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x1FFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY3_131072</name>
                  <description>The result of CMDn is ready to be read from RSLTn register. Clear this bit by reading the corresponding RSLTn register.where n=3...19.</description>
                  <value>0x20000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDY4</name>
                  <description>The result of CMD20 is ready to be read from RSLT20 register. Clear this bit by reading the corresponding RSLT20 register.</description>
                  <value>0x40000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT1</name>
          <description>Status 1 Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OVERLAP_CMDA</name>
              <description>Overlap Command for ADCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERLAP_FLAGA</name>
              <description>Overlap Interrupt Flag for ADCA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No trigger occurs on Trigger0 while the corresponding conversion process is ongoing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A trigger occurs on Trigger0 while the corresponding conversion process is ongoing. This trigger is ignored. Clear this bit by writing 1 to it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTVTIMEERR_CMDA</name>
              <description>Interval Time Configuration Error Command for ADCA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTVTIMEERR_FLAGA</name>
              <description>Interval Time Error Interrupt Flag for ADCA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>A interval time configuration error doesn't occur in ADCA &quot;Average with timer&quot; session in independence mode, or an interval time configuration error doesn't occur in an &quot;Average with timer&quot; session in cooperation mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A interval time configuration error occur in ADCA &quot;Average with timer&quot; session in independence mode, or an interval time configuration error occurs in an &quot;Average with timer&quot; session in cooperation mode. Clear this bit by writing 1 to it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERLAP_CMDB</name>
              <description>Overlap Command for ADCB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERLAP_FLAGB</name>
              <description>Overlap Interrupt Statuse for ADCB</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No trigger occurs on Trigger1 while the corresponding conversion process is ongoing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A trigger occurs for on Trigger1 while the corresponding conversion process is ongoing. This trigger is ignored. Clear this bit by writing 1 to it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTVTIMEERR_CMDB</name>
              <description>Interval Time Configuration Error Command for ADCB</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTVTIMEERR_FLAGB</name>
              <description>Interval Time Error Interrupt Flag for ADCB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>A interval time configuration error doesn't occour in ADCB &quot;Average with timer&quot; session.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A interval time configuration error occours in ADCB &quot;Average with timer&quot; session. Clear this bit by writing 1 to it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT2</name>
          <description>Status 2 Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EOSIA</name>
              <description>End of Scan Interrupt for ADCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No end of conversion scan interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>End of conversion scan interrupt pending. Clear this bit by writing 1 to it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTUPSTSB</name>
              <description>ADC Startup Status for ADCB</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC hasn't startup completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>ADC startup completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOSIB</name>
              <description>End of Scan Interrupt for ADCB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No end of conversion scan interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>End of conversion scan interrupt pending.Clear this bit by writing 1 to it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTUPSTSA</name>
              <description>ADC Startup Status for ADCA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC hasn't startup completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>ADC startup completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20</dimIndex>
          <name>RSLT%s</name>
          <description>Digital Result of the Conversion</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSLT</name>
              <description>Digital Result of the Conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OFSTRIM</name>
          <description>Offset Trim Register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFSTRIMA</name>
              <description>Trim for Offset for ADCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFSTRIMB</name>
              <description>Trim for Offset for ADCB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSTRIM</name>
          <description>High Speed Trim Register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTRIMA</name>
              <description>Trim for High Speed ADCA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTRIMB</name>
              <description>Trim for High Speed ADCB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GCC[%s]</name>
          <description>Gain Calibration Control</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN_CAL</name>
              <description>Gain Calibration Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDY</name>
              <description>Gain Calibration Value Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN_CAL_NOT_VALID</name>
                  <description>The GAIN_CAL value is invalid. Run the hardware calibration routine for this value to be set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARDWARE_CAL_ROUTINE_COMPLETED</name>
                  <description>The GAIN_CAL value is valid. GAIN_CAL should be used by software to derive GCRa[GCALR].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GCR[%s]</name>
          <description>Gain Calculation Result</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GCALR</name>
              <description>Gain Calculation Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDY</name>
              <description>Gain Calculation Ready</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_VALID</name>
                  <description>The GCALR value is invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>The GCALR value is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GAR[%s]</name>
          <description>Calibration A-side Registers</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GAR_VAL</name>
              <description>Calibration General ADCA Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>33</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CAL_GBR[%s]</name>
          <description>Calibration B-side Registers</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_GBR_VAL</name>
              <description>Calibration General ADCB Register Element</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
